Jonah-Zhang1/Jonah-Zhang1/R422_S32K324_TEMPLATE_ETH_M7_0/MCAL/Adc_TS_T40D34M20I0R0/src/Adc_Ipw_Irq.c
static inline Adc_StreamNumSampleType Adc_Ipw_GetNumsCurrentSample(const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                                   const Adc_GroupConfigurationType * const GroupPtr,
                                                                   boolean RuntimeChanUpdated);

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
static inline boolean Adc_Ipw_CheckNotification(Adc_GroupType Group,
                                                uint32 CoreId);
#endif /* ADC_GRP_NOTIF_CAPABILITY == STD_ON */
#if (defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) || defined(ADC_UNIT_2_NORMAL_ISR_USED) || \
     defined(ADC_UNIT_0_DMA_TRANSFER_USED) || defined(ADC_UNIT_1_DMA_TRANSFER_USED) || defined(ADC_UNIT_2_DMA_TRANSFER_USED) || \
     ((defined(ADC_UNIT_0_INJECTED_ISR_USED) || defined(ADC_UNIT_1_INJECTED_ISR_USED) || defined(ADC_UNIT_2_INJECTED_ISR_USED)) && (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)) \
    )
static inline void Adc_Ipw_UpdateQueue(Adc_HwUnitType Unit,
                                       uint32 CoreId);

static inline void Adc_Ipw_UpdateGroupState(Adc_HwUnitType Unit,
                                            Adc_GroupType Group,
                                            Adc_StreamNumSampleType GroupSamples,
                                            boolean InjectedFlag,
                                            uint32 CoreId);
#endif /* defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) ||... */

#ifdef ADC_DMA_SUPPORTED
static inline void Adc_Ipw_UpdateTcdDestAddr(const Adc_GroupConfigurationType * GroupPtr,
                                             const uint32 DmaLogicChannel);

static inline void Adc_Ipw_EnableDmaHwRequest(Adc_HwUnitType Unit,
                                              const Adc_GroupConfigurationType * GroupPtr,
                                              const Adc_Ipw_Config * const AdcIpwConfigPtr);

#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
static inline Std_ReturnType Adc_Ipw_CheckGroupConvResultDma(const Adc_GroupConfigurationType * GroupPtr,
                                                             uint32 AdcDmaLogicChId,
                                                             uint32 CoreId);
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
#endif /* ADC_DMA_SUPPORTED */
#if (defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) || defined(ADC_UNIT_2_NORMAL_ISR_USED) || \
     defined(ADC_UNIT_0_DMA_TRANSFER_USED) || defined(ADC_UNIT_1_DMA_TRANSFER_USED) || defined(ADC_UNIT_2_DMA_TRANSFER_USED) || \
     ((defined(ADC_UNIT_0_INJECTED_ISR_USED) || defined(ADC_UNIT_1_INJECTED_ISR_USED) || defined(ADC_UNIT_2_INJECTED_ISR_USED)) && (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)) \
    )
#if (ADC_SETCHANNEL_API == STD_ON)
static inline void Adc_Ipw_ConfigureRuntimeSoftwareGroup(const Adc_GroupConfigurationType * GroupPtr,
                                                         Adc_HwUnitType PhysicalHwUnitId,
                                                         boolean InjectedFlag,
                                                         uint32 CoreId);
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

static inline void Adc_Ipw_EndSoftwareConv(Adc_HwUnitType Unit,
                                           boolean InjectedFlag,
                                           uint32 CoreId);
#endif /* defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) ||... */

#if (ADC_HW_TRIGGER_API == STD_ON)
#if ( \
        ((defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) || defined(ADC_UNIT_2_NORMAL_ISR_USED)) && (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)) || \
        defined(ADC_UNIT_0_INJECTED_ISR_USED) || defined(ADC_UNIT_1_INJECTED_ISR_USED) || defined(ADC_UNIT_2_INJECTED_ISR_USED) || \
        defined(ADC_UNIT_0_DMA_TRANSFER_USED) || defined(ADC_UNIT_1_DMA_TRANSFER_USED) || defined(ADC_UNIT_2_DMA_TRANSFER_USED) || \
        ((defined(ADC_UNIT_0_BCTU_LIST_ISR_USED) || defined(ADC_UNIT_1_BCTU_LIST_ISR_USED) || defined(ADC_UNIT_2_BCTU_LIST_ISR_USED)) && (ADC_IPW_BCTU_AVAILABLE == STD_ON)) \
    )
#if (ADC_SETCHANNEL_API == STD_ON)
static inline Std_ReturnType Adc_Ipw_ConfigureRuntimeHardwareGroup(Adc_HwUnitType Unit,
                                                                   boolean InjectedFlag,
                                                                   uint32 CoreId);
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
static inline void Adc_Ipw_DisableHwTriggerSrc(Adc_HwUnitType Unit,
                                               boolean InjectedFlag,
                                               Adc_HwTriggerTimerType TriggerSrc,
                                               uint32 CoreId);
#endif /* ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF */

static inline void Adc_Ipw_EndHardwareConv(Adc_HwUnitType Unit,
                                           boolean InjectedFlag,
                                           uint32 CoreId);
#endif /* (((defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) || ... */
#endif /* ADC_HW_TRIGGER_API == STD_ON */

#if (defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_0_DMA_TRANSFER_USED) || \
     defined(ADC_UNIT_1_NORMAL_ISR_USED) || defined(ADC_UNIT_1_DMA_TRANSFER_USED) || \
     defined(ADC_UNIT_2_NORMAL_ISR_USED) || defined(ADC_UNIT_2_DMA_TRANSFER_USED) \
    )
static inline void Adc_Ipw_EndNormalChainNotification(const Adc_HwUnitType PhysicalAdcUnit);
#endif /* (defined(ADC_UNIT_0_NORMAL_ISR_USED) || ... */

#if (defined(ADC_UNIT_0_INJECTED_ISR_USED) || defined(ADC_UNIT_0_DMA_TRANSFER_USED) || \
     defined(ADC_UNIT_1_INJECTED_ISR_USED) || defined(ADC_UNIT_1_DMA_TRANSFER_USED) || \
     defined(ADC_UNIT_2_INJECTED_ISR_USED) || defined(ADC_UNIT_2_DMA_TRANSFER_USED) \
    )
static inline void Adc_Ipw_EndInjectedChainNotification(const Adc_HwUnitType PhysicalAdcUnit);
#endif /* (defined(ADC_UNIT_0_INJECTED_ISR_USED) || ... */

static inline void Adc_Ipw_ReadData(const Adc_GroupConfigurationType * GroupPtr,
                                    Adc_ValueGroupType * Result,
                                    const Adc_StreamNumSampleType GroupSamples,
                                    const Adc_ChannelIndexType Index,
                                    const uint16 ConvResult);

