Jonah-Zhang1/Jonah-Zhang1/R422_S32K324_TEMPLATE_ETH_M7_0/MCAL/Adc_TS_T40D34M20I0R0/src/Adc_Ipw_Irq.c
#if (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON)
static inline void Adc_Ipw_CallExtraNotification(Adc_GroupType Group,
                                                 uint32 CoreId);
#endif /* (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON) */
#endif  /* (defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) || ... */

#if ((defined(ADC_UNIT_0_WDG_ISR_USED)) || (defined(ADC_UNIT_1_WDG_ISR_USED)) || \
     (defined(ADC_UNIT_2_WDG_ISR_USED)) || (defined(ADC_UNIT_3_WDG_ISR_USED)) \
    )
#if defined(ADC_WDG_SUPPORTED)
static inline void Adc_Ipw_WdgThresholdNotification(const Adc_HwUnitType PhysicalAdcUnit,
                                                    const Adc_ChannelType PhysicalChanId,
                                                    const uint8 Flags);
#endif /* defined(ADC_WDG_SUPPORTED) */
#endif /* defined(ADC_UNIT_0_WDG_ISR_USED) || ... */


/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/
#if (defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) || defined(ADC_UNIT_2_NORMAL_ISR_USED) || \
     defined(ADC_UNIT_0_INJECTED_ISR_USED) || defined(ADC_UNIT_1_INJECTED_ISR_USED) || defined(ADC_UNIT_2_INJECTED_ISR_USED) || \
     defined(ADC_UNIT_0_DMA_TRANSFER_USED) || defined(ADC_UNIT_1_DMA_TRANSFER_USED) || defined(ADC_UNIT_2_DMA_TRANSFER_USED) \
    )
#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
/**
* @brief          This function check if channel is enabled/disabled.
* @details        This function check if channel is enabled/disabled.
*
* @param[in]      LogicalHwUnitId   Hardware index in the structure.
* @param[in]      GroupId           Group index.
* @param[in]      ChIndex           Channel index of group.
* @param[in]      CoreId            Current CoreID.
*
* @return         Std_ReturnType    E_OK or E_NOT_OK.
* @retval         E_OK              Channel is enabled.
* @retval         E_NOT_OK          Channel is disabled.
*
*/
static inline Std_ReturnType Adc_Ipw_IsChannelEnable(Adc_HwUnitType LogicalHwUnitId,
                                                     Adc_GroupType GroupId,
                                                     Adc_ChannelType ChIndex,
                                                     uint32 CoreId)
{
    uint32 ChannelEnBit = 0UL;
    Std_ReturnType ReturnValue = (Std_ReturnType)E_NOT_OK;
    const uint32 PhysicalChanId = Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr->AdcConfigPtrArr[LogicalHwUnitId]->ChannelConfigsPtr[ChIndex].ChanIndex;

    if (PhysicalChanId < 32u)
    {
        ChannelEnBit = (Adc_axRuntimeChansEnMask[GroupId].ChanMaskArr[0u] >> PhysicalChanId) & 1UL;
    }
    #if (ADC_IPW_NUM_OF_GROUP_CHN > 1u)
    else if (PhysicalChanId < 64u)
    {
        ChannelEnBit = (Adc_axRuntimeChansEnMask[GroupId].ChanMaskArr[1u] >> (PhysicalChanId % 32u)) & 1UL;
    }
    #endif /* (ADC_IPW_NUM_OF_GROUP_CHN > 1u) */
    #if (ADC_IPW_NUM_OF_GROUP_CHN > 2u)
    else if (PhysicalChanId < 96u)
    {
        ChannelEnBit = (Adc_axRuntimeChansEnMask[GroupId].ChanMaskArr[2u] >> (PhysicalChanId % 32u)) & 1UL;
    }
    #endif /* (ADC_IPW_NUM_OF_GROUP_CHN > 2u) */
    else
    {
        ; /* Empty else branch to avoid MISRA */
    }
    #if (ADC_IPW_NUM_OF_GROUP_CHN > 3u)
    #error "Adc IPW ADC_IPW_NUM_OF_GROUP_CHN out of range."
    #endif /* (ADC_IPW_NUM_OF_GROUP_CHN > 3u) */

    if (1UL == ChannelEnBit)
    {
        ReturnValue = (Std_ReturnType)E_OK;
    }

    return ReturnValue;
}
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */

/**
* @brief          This function gets the conversion result and save to buffer
* @details        This function gets the conversion result and save to buffer
*
* @param[in]      Unit              The used hardware unit
* @param[in]      Group             The group to be converted
* @param[in]      GroupSamples      Number of group samples
* @param[in]      CoreId            Current CoreID
*
* @return         Std_ReturnType    Checking value
* @retval         E_OK              Result is satisfied limit checking function
* @retval         E_NOT_OK          Result is NOT satisfied limit checking function
*
* @implements Adc_Ipw_RecordResult_Activity
*/
static inline Std_ReturnType Adc_Ipw_RecordResult(Adc_HwUnitType Unit,
                                                  Adc_GroupType Group,
                                                  Adc_StreamNumSampleType GroupSamples,
                                                  uint32 CoreId)
{
    Adc_GroupType GroupIndex = Adc_apxCfgPtr[CoreId]->GroupIdToIndexMapPtr[Group];
    Adc_ChannelIndexType Ch = 0U;
    Adc_ChannelType ChIndex = 0U;
    Adc_ValueGroupType * Result = NULL_PTR;
    Std_ReturnType ReturnValue = (Std_ReturnType)E_OK;
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];
    const Adc_GroupDefType * Channel;
    const Adc_Sar_Ip_ConfigType * AdcPtr = Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr->AdcConfigPtrArr[Unit];
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[CoreId]->GroupsPtr[GroupIndex]);
    Adc_Sar_Ip_ChanResultType AdcResult;
    Adc_TriggerSourceType GrTriggerSrc = GroupPtr->TriggerSource;

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
    Adc_GroupType GroupId;
    Std_ReturnType ChannelEnable;
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */

#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    /* Flag to set if ADC results are in the range selected */
    boolean Flag;
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */
    Adc_ChannelIndexType ChannelCount;

#if (ADC_SETCHANNEL_API == STD_ON)
    /* Get channel count at runtime */
    ChannelCount = Adc_axRuntimeGroupChannel[Group].ChannelCount;
    Channel = &(Adc_axRuntimeGroupChannel[Group].ChannelPtr[0u]);
#else
    /* Get channel count from configuration */
    ChannelCount = GroupPtr->AssignedChannelCount;
    Channel = &(GroupPtr->AssignmentPtr[0u]);
#endif

#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
    /* Get the result buffer pointer */
    if (FALSE == GroupPtr->StreamResultGroupMultiSets)
    {
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */
        Result = &(Adc_axGroupStatus[Group].ResultsBufferPtr[Adc_axGroupStatus[Group].ResultIndex]);
#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
    }
    else
    {
        Result = &(Adc_axGroupStatus[Group].ResultsBufferPtr[Adc_axGroupStatus[Group].ResultIndex * ChannelCount]);
    }
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */

    for (Ch = 0U; Ch < ChannelCount; Ch++)
    {
        ChIndex = Channel[Ch];

        /* Get the result */
        if (ADC_TRIGG_SRC_SW == GrTriggerSrc)
        {
            Adc_Sar_Ip_GetConvResult(PhysicalHwUnitId, (uint32)(AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex), (Adc_Sar_Ip_ConvChainType)GroupPtr->Type, &AdcResult);
        }
#if (STD_ON == ADC_HW_TRIGGER_API)
        else
        {
            if (GroupPtr->HwTriggerSource <= (Adc_HwTriggerTimerType) ADC_IPW_MAX_CTU_TRIG_SOURCE_ID)
            {
                /* Data conversion comes from CTU Trigger */
                Adc_Sar_Ip_GetConvResult(PhysicalHwUnitId, (uint32)(AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex), ADC_SAR_IP_CONV_CHAIN_CTU, &AdcResult);
            }
            else
            {
                /* Data conversion comes from Normal and Injected Trigger */
                Adc_Sar_Ip_GetConvResult(PhysicalHwUnitId, (uint32)(AdcPtr->ChannelConfigsPtr[ChIndex].ChanIndex), (Adc_Sar_Ip_ConvChainType)GroupPtr->Type, &AdcResult);
            }
        }
#endif /* (STD_ON == ADC_HW_TRIGGER_API) */

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
        /* Get index of the group with AdcEnableChDisableChGroup enabled */
        GroupId = (Adc_GroupType)GroupPtr->EnableChDisableChGroupIndex;
        /* Check if group have AdcEnableChDisableChGroup enabled */
        if (ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX != GroupId)
        {
            /* Check if ChIndex is enabled */
            ChannelEnable = Adc_Ipw_IsChannelEnable(Unit, GroupId, ChIndex, CoreId);
        }
        else
        {
            /* ChIndex is always enabled when AdcEnableChDisableChGroup disabled */
            ChannelEnable = E_OK;
        }
        if ((Std_ReturnType)E_OK == ChannelEnable)
#endif /* ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON */
        {
            /* If channel is enabled, check valid and result bit */
            if (TRUE == AdcResult.ValidFlag)
            {
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
                /* Checks if conversion values are in the configured range */
                if (
                        (TRUE == GroupPtr->AdcGroupLimitcheck)
#if (ADC_SETCHANNEL_API == STD_ON)
                        || (TRUE == Adc_axRuntimeGroupChannel[Group].AdcRuntimeGroupLimitcheck)
#endif /* ADC_SETCHANNEL_API == STD_ON */
                   )
                {
                    Flag = Adc_Ipw_CheckConversionValuesInRange(AdcResult.ConvData, Unit, ChIndex, CoreId);
                    if (TRUE == Flag)
                    {
                        Adc_Ipw_ReadData(GroupPtr, Result, GroupSamples, Ch, AdcResult.ConvData);
                    }
                    else
                    {
                        /* SWS_Adc_00448 */
                        /* Return an error */
                        Adc_axGroupStatus[Group].AlreadyConverted = ADC_ALREADY_CONVERTED;
                        Adc_axGroupStatus[Group].LimitCheckFailed = TRUE;

                        ReturnValue = (Std_ReturnType)E_NOT_OK;
                    }
                }
                else /* In case of AdcGroupLimitcheck = FALSE */
                {
                    Adc_Ipw_ReadData(GroupPtr, Result, GroupSamples, Ch, AdcResult.ConvData);
                    Adc_axGroupStatus[Group].LimitCheckFailed = FALSE;
                }
#else
                Adc_Ipw_ReadData(GroupPtr, Result, GroupSamples, Ch, AdcResult.ConvData);
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */
            }
            else /* In case of result is not true for this convert type*/
            {
                ReturnValue = (Std_ReturnType)E_NOT_OK;
            }

            if ((Std_ReturnType)E_NOT_OK == ReturnValue)
            {
                break;
            }
        }
    }
    return ReturnValue;
}

