Jonah-Zhang1/Jonah-Zhang1/R422_S32K324_TEMPLATE_ETH_M7_0/MCAL/Adc_TS_T40D34M20I0R0/src/Adc_Ipw_Irq.c
static inline Adc_StreamNumSampleType Adc_Ipw_GetNumsCurrentSample(const Adc_Ipw_Config * const AdcIpwConfigPtr,
                                                                   const Adc_GroupConfigurationType * const GroupPtr,
                                                                   boolean RuntimeChanUpdated)
{
    Adc_StreamNumSampleType NumsCurrentSample = 0U;
    const Adc_GroupType Group = GroupPtr->GroupId;
#ifdef ADC_DMA_SUPPORTED
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
    uint32 CurrentIter = 0U;
    const Adc_HwUnitType LogicalHwUnitId = GroupPtr->AdcLogicalUnitId;
    const Adc_StreamNumSampleType GroupSamples = GroupPtr->NumSamples;
    const uint32 AdcDmaLogicChId = AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[LogicalHwUnitId];
    const uint32 AdcCountingDmaLogicChId = AdcIpwConfigPtr->Mapping.AdcCountingDmaChanLogicId[LogicalHwUnitId];

    if (TRUE == GroupPtr->AdcOptimizeDmaStream)
    {
        if (1U < (GroupPtr->AssignedChannelCount))
        {
            (void)Dma_Ip_GetLogicChannelParam(AdcCountingDmaLogicChId, DMA_IP_CH_GET_CURRENT_ITER_COUNT, &CurrentIter);
        }
        else
        {
            (void)Dma_Ip_GetLogicChannelParam(AdcDmaLogicChId, DMA_IP_CH_GET_CURRENT_ITER_COUNT, &CurrentIter);
        }

        /* This condition only occurs at half interrupt */
        if (CurrentIter != GroupSamples)
        {
            /* Re-calculate NumsCurrentSample because CITER decrements its value from GroupSamples to 1 */
            NumsCurrentSample = GroupSamples - (Adc_StreamNumSampleType)CurrentIter;
        }
        else
        {
            /* When major loop completed, CITER roll back to be equal to GroupSamples so no need to re-calculate */
            NumsCurrentSample = (Adc_StreamNumSampleType)CurrentIter;
        }
        Adc_axGroupStatus[Group].ResultIndex = NumsCurrentSample;
    }
    else
#endif /* (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) */
#endif /* ADC_DMA_SUPPORTED */
    {
        if (
            (ADC_TRIGG_SRC_SW != GroupPtr->TriggerSource)
#if (ADC_SETCHANNEL_API == STD_ON)
             && (FALSE == RuntimeChanUpdated)
#endif /* (ADC_SETCHANNEL_API == STD_ON) */
           )
        {
            /* Increment ResultIndex with modulo 'NumSamples' to remember that another sample is completed */
            Adc_axGroupStatus[Group].ResultIndex++;
        }
        NumsCurrentSample = Adc_axGroupStatus[Group].ResultIndex;
    }

    /* Avoid Compiler Warning */
    (void) AdcIpwConfigPtr;
    (void) RuntimeChanUpdated;

    return NumsCurrentSample;
}

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
/**
* @brief          This function checks group notification
* @details        This function checks group notification
*
* @param[in]      Group             The group to be converted
* @param[in]      CoreId            Current CoreID
*
* @return         boolean      Checking result
* @retval         TRUE:        Notification call is available
* @retval         FALSE:       Notification call is NOT available
*
*/
static inline boolean Adc_Ipw_CheckNotification(Adc_GroupType Group,
                                                uint32 CoreId)
{
    Adc_GroupType GroupIndex = Adc_apxCfgPtr[CoreId]->GroupIdToIndexMapPtr[Group];
    boolean CallNotification =  FALSE;

    /* SWS_Adc_00080, SWS_Adc_00083 */
    if ((ADC_NOTIFICATION_ENABLED == Adc_axGroupStatus[Group].Notification) && \
        (NULL_PTR != Adc_apxCfgPtr[CoreId]->GroupsPtr[GroupIndex].Notification)
       )
    {
        CallNotification =  TRUE;
    }
    return CallNotification;
}
#endif /* ADC_GRP_NOTIF_CAPABILITY == STD_ON */

#if (defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) || defined(ADC_UNIT_2_NORMAL_ISR_USED) || \
     defined(ADC_UNIT_0_DMA_TRANSFER_USED) || defined(ADC_UNIT_1_DMA_TRANSFER_USED) || defined(ADC_UNIT_2_DMA_TRANSFER_USED) || \
     ((defined(ADC_UNIT_0_INJECTED_ISR_USED) || defined(ADC_UNIT_1_INJECTED_ISR_USED) || defined(ADC_UNIT_2_INJECTED_ISR_USED)) && (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)) \
    )
/**
* @brief          This function updates queue
* @details        This function updates queue elements after a conversion
*                 and start conversion if requests are still available in queue
*
* @param[in]      Unit              The ADC hardware unit
* @param[in]      CoreId            Current CoreID
*
* @return         void
*
*/
static inline void Adc_Ipw_UpdateQueue(Adc_HwUnitType Unit,
                                       uint32 CoreId)
{
#if (ADC_ENABLE_QUEUING == STD_ON)
    /* Remove current request element in queue */
    Adc_Ipw_RemoveFromQueue(Unit, 0U);
#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
    if (Adc_axUnitStatus[Unit].SwNormalQueueIndex > (Adc_QueueIndexType)0U)
    {
        /* Start conversion if request elements are still available in queue */
        Adc_Ipw_StartNormalConversion(Unit, CoreId);
    }
#endif
#else
    /* No element will be present in the queue */
    Adc_axUnitStatus[Unit].SwNormalQueueIndex= (Adc_QueueIndexType)0;
#endif /* ADC_ENABLE_QUEUING == STD_ON */
    (void)CoreId;
}

/**
* @brief          This function update state of software conversion according to AutoSar diagrams
* @details        This function update state of software conversion according to AutoSar diagrams
*
* @param[in]      Unit              ADC hardware unit
* @param[in]      Group             ADC group number
* @param[in]      GroupSamples      Number of samples per channel in streaming access mode
* @param[in]      InjectedFlag      Normal or injected conversion
* @param[in]      CoreId            Current CoreID
*
* @return         void
*
*/
static inline void Adc_Ipw_UpdateGroupState(Adc_HwUnitType Unit,
                                            Adc_GroupType Group,
                                            Adc_StreamNumSampleType GroupSamples,
                                            boolean InjectedFlag,
                                            uint32 CoreId)
{
    Adc_GroupType GroupIndex = Adc_apxCfgPtr[CoreId]->GroupIdToIndexMapPtr[Group];
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[CoreId]->GroupsPtr[GroupIndex]);
    Adc_StreamNumSampleType CurrentSampleCount = 0U;
    const Adc_Ipw_Config * const AdcIpwConfigPtr = Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr;
#ifdef ADC_DMA_SUPPORTED
    const uint32 AdcDmaLogicChId = AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[Unit];
    Dma_Ip_LogicChannelScatterGatherListType LocTransferList[1U];
#endif /* ADC_DMA_SUPPORTED */
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
    boolean  CallNotification = FALSE;
#endif
    boolean StreamBuffLinear = FALSE;

    CurrentSampleCount = Adc_Ipw_GetNumsCurrentSample(AdcIpwConfigPtr, GroupPtr, FALSE);
    /* At least once the group was converted */
    Adc_axGroupStatus[Group].AlreadyConverted = ADC_ALREADY_CONVERTED;

    if (ADC_BUSY == Adc_axGroupStatus[Group].Conversion)
    {
        /* SWS_Adc_00224 */
        Adc_axGroupStatus[Group].Conversion = ADC_COMPLETED;
    }

