Jonah-Zhang1/Jonah-Zhang1/R422_S32K324_TEMPLATE_ETH_M7_0/MCAL/Adc_TS_T40D34M20I0R0/src/Adc_Ipw_Irq.c
    /* If buffer is full of samples, wrap to 0 */
    if (GroupSamples <= CurrentSampleCount)
    {
        /* Change to stream complete according to AUTOSAR diagram */
        /* SWS_Adc_00325 */
        Adc_axGroupStatus[Group].Conversion = ADC_STREAM_COMPLETED;

        if ((ADC_STREAM_BUFFER_LINEAR == GroupPtr->BufferMode) && \
           (ADC_ACCESS_MODE_STREAMING == GroupPtr->AccessMode)
          )
        {
            StreamBuffLinear = TRUE;
#ifdef ADC_DMA_SUPPORTED
            /* Not required to check AdcWithoutDma == FALSE, because AdcWithoutDma is only supported for SW normal triggered which cannot be ADC_ACCESS_MODE_STREAMING when DMA transfer selected for HW unit */
            if (ADC_DMA == AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit])
            {
                /* Disable ADC DMA Request */
                Adc_Sar_Ip_DisableChannelDma(PhysicalHwUnitId, GroupPtr->LastCh);
                Adc_Sar_Ip_DisableDma(PhysicalHwUnitId);
            }
#endif /* ADC_DMA_SUPPORTED */

            if (Adc_Sar_Ip_AbortChain(PhysicalHwUnitId, TRUE, FALSE) == ADC_SAR_IP_STATUS_SUCCESS)
            {
                Adc_Ipw_ClearValidBit(Unit, Group, CoreId);
#if (defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) || defined(ADC_UNIT_2_NORMAL_ISR_USED))
                Adc_Sar_Ip_DisableNotifications(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN);
#endif /* (defined(ADC_UNIT_0_NORMAL_ISR_USED) || ... */
                Adc_Sar_Ip_ClearStatusFlags(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN);

                /* Update queue and execute new start conversion request from queue if available */
                Adc_Ipw_UpdateQueue(Unit, CoreId);

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
                /* Check user notification function and execute if available */
                CallNotification = Adc_Ipw_CheckNotification(Group, CoreId);

                if (TRUE == CallNotification)
                {
                    /* SWS_Adc_00140, SWS_Adc_00060 */
                    GroupPtr->Notification();
                }
#endif /* ADC_GRP_NOTIF_CAPABILITY == STD_ON */
            }
        }
        else
        {
            Adc_axGroupStatus[Group].ResultIndex = 0U;
#ifdef ADC_DMA_SUPPORTED
            if (ADC_DMA == AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit])
            {
                if (((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable) && (1U == GroupPtr->AssignedChannelCount))
                {
                    LocTransferList[0].Param = DMA_IP_CH_SET_DESTINATION_ADDRESS;
                    LocTransferList[0].Value = (uint32)(&(Adc_axGroupStatus[Group].ResultsBufferPtr[Adc_axGroupStatus[Group].ResultIndex]));
                    (void)Dma_Ip_SetLogicChannelTransferList(AdcDmaLogicChId, LocTransferList, 1U);
                }
            }
#endif /* ADC_DMA_SUPPORTED */
        }
    }

    if (FALSE == StreamBuffLinear)
    {
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
        CallNotification = Adc_Ipw_CheckNotification(Group, CoreId);
#endif /* ADC_GRP_NOTIF_CAPABILITY == STD_ON */

        if (ADC_CONV_MODE_ONESHOT == GroupPtr->Mode)
        {
            /* SWS_Adc_00325 */
            Adc_axGroupStatus[Group].Conversion = ADC_STREAM_COMPLETED;

            if (FALSE == InjectedFlag)
            {
                /* Disable Normal Interrupt Mask */
#if (defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) || defined(ADC_UNIT_2_NORMAL_ISR_USED))
                Adc_Sar_Ip_DisableNotifications(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN);
#endif /* (defined(ADC_UNIT_0_NORMAL_ISR_USED) || ... */
                Adc_Ipw_UpdateQueue(Unit, CoreId);
            }
#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)
            else
            {
#if (defined(ADC_UNIT_0_INJECTED_ISR_USED) || defined(ADC_UNIT_1_INJECTED_ISR_USED) || defined(ADC_UNIT_2_INJECTED_ISR_USED))
                Adc_Sar_Ip_DisableNotifications(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN);
#endif /* (defined(ADC_UNIT_0_INJECTED_ISR_USED) || ... */
                /* No element will be present in the sw inj queue */
                Adc_axUnitStatus[Unit].SwInjectedQueueIndex = 0U;
            }
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */
        }

#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)
        if (TRUE == InjectedFlag)
        {
            /* Clear injected end of chain interrupt flag */
            Adc_Sar_Ip_ClearStatusFlags(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN);
        }
        else
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */
        {
            /* Clear normal end of chain interrupt flag */
            Adc_Sar_Ip_ClearStatusFlags(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN);
        }

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
        if (TRUE == CallNotification)
        {
            /* Call user notification (SWS_Adc_00140, SWS_Adc_00060) */
            GroupPtr->Notification();
        }
#endif /* ADC_GRP_NOTIF_CAPABILITY == STD_ON */
#ifdef ADC_DMA_SUPPORTED
        if (ADC_DMA == AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit])
        {
            if ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
            {
                /* Update the Next Destination Address for Streaming Group. For Software Single Group, the DMA will be re-configured by Adc_StartGroupConversion */
                if (ADC_ACCESS_MODE_STREAMING == GroupPtr->AccessMode)
                {
                    Adc_Ipw_UpdateTcdDestAddr(GroupPtr, AdcDmaLogicChId);
                }
                Adc_Ipw_EnableDmaHwRequest(Unit, GroupPtr, AdcIpwConfigPtr);
            }
        }
#endif /* ADC_DMA_SUPPORTED */
    }
}
#endif /* defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) ||... */

#ifdef ADC_DMA_SUPPORTED

/**
* @brief        This function updates TCD Destination Address of Next Result Buffer for Streaming Group
* @details      This function is called after one sample completes the conversion. The next address of
*               Result Buffer should be updated if number of channel in the Group greater than one.
*
* @param[in]    GroupPtr           The pointer to the group configuration structure.
* @param[in]    DmaLogicChannel  The Logical Dma Channel Id that was configured.
*
* @return       void
*
*/
static inline void Adc_Ipw_UpdateTcdDestAddr(const Adc_GroupConfigurationType * GroupPtr,
                                             const uint32 DmaLogicChannel)
{
    uint8 Index;
    const Adc_StreamNumSampleType GroupNumSample = GroupPtr->NumSamples;
    const Adc_GroupType Group = GroupPtr->GroupId;
    const Adc_ChannelIndexType ChannelCount = GroupPtr->AssignedChannelCount;
    uint32 DestAddOff;
    Dma_Ip_LogicChannelScatterGatherListType LocTransferList[1U];

    if ( \
            (1U < ChannelCount)
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
         && (FALSE == GroupPtr->AdcOptimizeDmaStream)
#endif /* ADC_OPTIMIZE_DMA_STREAMING_GROUPS = STD_ON */
       )
    {
#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
        if (FALSE == GroupPtr->StreamResultGroupMultiSets)
        {
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */
            DestAddOff = (uint32)Adc_axGroupStatus[Group].ResultIndex << 1UL;
#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
        }
        else
        {
            DestAddOff = ((uint32)Adc_axGroupStatus[Group].ResultIndex * ChannelCount) << 1UL;
        }
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */

        for (Index = 0; Index < ChannelCount; Index++)
        {
            LocTransferList[0].Param = DMA_IP_CH_SET_DESTINATION_ADDRESS;

#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
            if (FALSE == GroupPtr->StreamResultGroupMultiSets)
            {
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */
                LocTransferList[0].Value = (uint32)(&(Adc_axGroupStatus[Group].ResultsBufferPtr[Index * GroupNumSample])) + DestAddOff;
#if (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON)
            }
            else
            {
                LocTransferList[0].Value = (uint32)(&(Adc_axGroupStatus[Group].ResultsBufferPtr[Index])) + DestAddOff;
            }
#endif /* (ADC_ENABLE_GROUP_STREAMING_RESULTS_REORDER == STD_ON) */

            /* Write TCD Configuration for each channel */
            (void)Dma_Ip_SetLogicChannelScatterGatherList(DmaLogicChannel, Index, LocTransferList, 1U);
        }
        /* Write the first Software TCD to the Hardware. The next one will be loaded automaticaly by Scatter/Gather Programming */
        (void)Dma_Ip_SetLogicChannelScatterGatherConfig(DmaLogicChannel, 0U);
    }
}

/**
* @brief        This function enables DMA Hardware request
* @details      This function enables DMA Hardware request which was disabled automatically (by enabling DREQ) at the end of DMA major loop.
*
* @param[in]    Unit                  Physical HW unit index.
* @param[in]    GroupPtr             Configuration pointer of group.
* @param[in]    AdcIpwConfigPtr      Configuration pointer contains DMA channel ID.
*
* @return       void
*
*/
static inline void Adc_Ipw_EnableDmaHwRequest(Adc_HwUnitType Unit,
                                              const Adc_GroupConfigurationType * GroupPtr,
                                              const Adc_Ipw_Config * const AdcIpwConfigPtr)
{
    uint32 AdcDmaLogicChId = (uint32) AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[Unit];
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
    Adc_GroupType Group = GroupPtr->GroupId;

    if (TRUE == GroupPtr->AdcOptimizeDmaStream)
    {
        if ((ADC_STREAM_COMPLETED == Adc_axGroupStatus[Group].Conversion) && (1U == (GroupPtr->AssignedChannelCount)))
        {
            /* DMA Hardware Request was disabled after transfer completed, to avoid overwriting any new results before this gets processed. Re-enable DMA here. */
            (void)Dma_Ip_SetLogicChannelCommand(AdcDmaLogicChId, DMA_IP_CH_SET_HARDWARE_REQUEST);
        }
    }
    else
#endif /* (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) */
    {
        /* DMA Hardware Request was disabled after transfer completed, to avoid overwriting any new results before this gets processed. Re-enable DMA here. */
        (void)Dma_Ip_SetLogicChannelCommand(AdcDmaLogicChId, DMA_IP_CH_SET_HARDWARE_REQUEST);
        /* Avoid Compiler Warning */
        (void)GroupPtr;
    }
}

