Jonah-Zhang1/Jonah-Zhang1/R422_S32K324_TEMPLATE_ETH_M7_0/MCAL/Adc_TS_T40D34M20I0R0/src/Adc_Ipw_Irq.c
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
/**
* @brief          This function checks the conversion result when Limit Check and DMA are enabled.
* @details        This function checks the conversion result when Limit Check and DMA are enabled.
*
* @param[in]      GroupPtr         The Adc Group Pointer.
* @param[in]      AdcDmaLogicChId  Dma logical channel
* @param[in]      CoreId           Current CoreID
*
* @return         Std_ReturnType
*
*/
static inline Std_ReturnType Adc_Ipw_CheckGroupConvResultDma(const Adc_GroupConfigurationType * GroupPtr,
                                                             uint32 AdcDmaLogicChId,
                                                             uint32 CoreId)
{
    Std_ReturnType ReturnValue = (Std_ReturnType)E_OK;
    const Adc_GroupType Group = GroupPtr->GroupId;
    const Adc_HwUnitType Unit = GroupPtr->AdcLogicalUnitId;
    const uint8 AvailableResolutions[4U] = ADC_IPW_AVAILABLE_RESOLUTIONS;
    Adc_ValueGroupType * ResultData = &(Adc_axGroupStatus[Group].ResultsBufferPtr[Adc_axGroupStatus[Group].ResultIndex]);
    Dma_Ip_LogicChannelScatterGatherListType LocTransferList[1U];
    Adc_ValueGroupType LocalValue = ResultData[0];

    if (TRUE == GroupPtr->AdcGroupLimitcheck)
    {
        if (FALSE == Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr->AdcConfigPtrArr[Unit]->BypassResolution)
        {
            /* Shift the result right to have the correct resolution for limit checking. */
            LocalValue >>= (ADC_SAR_IP_RESULT_RESOLUTION - AvailableResolutions[(uint8)(Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr->AdcConfigPtrArr[Unit]->AdcResolution)]);
        }
        /* Assumption: because of SWS_Adc_00451, the number of channels configured for a group when limit checking is disabled, must be one.*/
        if (FALSE == Adc_Ipw_CheckConversionValuesInRange(LocalValue, Unit, GroupPtr->AssignmentPtr[0], CoreId))
        {
            /* SWS_Adc_00448 */
            /* Return an error */
            Adc_axGroupStatus[Group].AlreadyConverted = ADC_ALREADY_CONVERTED;
            Adc_axGroupStatus[Group].LimitCheckFailed = TRUE;
            ResultData[0] = 0U;
            ReturnValue = (Std_ReturnType) E_NOT_OK;
            if ((uint8)STD_OFF == GroupPtr->AdcExtDMAChanEnable)
            {
                /* If the Result Conversion is out of range, need to reset Destination Address to previous Buffer Address. */
                /* Because the Destination Offset for Streaming Group that has one channel configured be 2U to reducing additional in the callback. */
                if (GroupPtr->AccessMode == ADC_ACCESS_MODE_STREAMING)
                {
                    LocTransferList[0].Param = DMA_IP_CH_SET_DESTINATION_ADDRESS;
                    LocTransferList[0].Value = (uint32)(&(Adc_axGroupStatus[Group].ResultsBufferPtr[Adc_axGroupStatus[Group].ResultIndex]));
                    (void)Dma_Ip_SetLogicChannelTransferList(AdcDmaLogicChId, LocTransferList, 1U);
                }
                /* DMA Hardware Request was disabled after transfer completed, to avoid overwriting any new results before this gets processed. Re-enable DMA here. */
                (void)Dma_Ip_SetLogicChannelCommand(AdcDmaLogicChId, DMA_IP_CH_SET_HARDWARE_REQUEST);
            }
        }
        else
        {
            Adc_axGroupStatus[Group].LimitCheckFailed = FALSE;
        }
    }

    return ReturnValue;
}
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
#endif /* ADC_DMA_SUPPORTED */

#if (defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) || defined(ADC_UNIT_2_NORMAL_ISR_USED) || \
     defined(ADC_UNIT_0_DMA_TRANSFER_USED) || defined(ADC_UNIT_1_DMA_TRANSFER_USED) || defined(ADC_UNIT_2_DMA_TRANSFER_USED) || \
     ((defined(ADC_UNIT_0_INJECTED_ISR_USED) || defined(ADC_UNIT_1_INJECTED_ISR_USED) || defined(ADC_UNIT_2_INJECTED_ISR_USED)) && (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)) \
    )
#if (ADC_SETCHANNEL_API == STD_ON)
/**
* @brief          This function reconfigures runtime updated channels
* @details        This function reconfigures runtime updated channels for software trigger groups
*
* @param[in]      GroupPtr                  Group configuration pointer
* @param[in]      PhysicalHwUnitId          Adc Physical Unit Id
* @param[in]      InjectedFlag              Injected (TRUE) or Normal (FALSE) group
* @param[in]      CoreId                    Current CoreID
*
* @return         void.
*/
static inline void Adc_Ipw_ConfigureRuntimeSoftwareGroup(const Adc_GroupConfigurationType * GroupPtr,
                                                         Adc_HwUnitType PhysicalHwUnitId,
                                                         boolean InjectedFlag,
                                                         uint32 CoreId)
{
    Adc_Sar_Ip_ConvChainType ChainType = ADC_SAR_IP_CONV_CHAIN_NORMAL;
    uint32 EndChainFlag = ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN;
    Adc_GroupType Group = GroupPtr->GroupId;
    Adc_HwUnitType LogicalHwUnitId = GroupPtr->AdcLogicalUnitId;
    Adc_Sar_Ip_ChansIdxMaskType CmrMask;

    if (ADC_SAR_IP_STATUS_SUCCESS == Adc_Sar_Ip_AbortChain(PhysicalHwUnitId, TRUE, FALSE))
    {
#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)
        if (TRUE == InjectedFlag)
        {
            ChainType = ADC_SAR_IP_CONV_CHAIN_INJECTED;
            EndChainFlag = ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN;
        }
#else
        (void)InjectedFlag;
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */

        Adc_axGroupStatus[Group].ResultIndex = 0U;
        /* Get run-time configuration and update normal conversion mask registers */
        Adc_Ipw_GetCmrRegister(LogicalHwUnitId, Group, &CmrMask, CoreId);
        Adc_Sar_Ip_ChainConfig(PhysicalHwUnitId, &CmrMask, ChainType);
        /* Clear pending ISR request which might occur with continuous groups */
        Adc_Sar_Ip_ClearStatusFlags(PhysicalHwUnitId, EndChainFlag);
        Adc_axRuntimeGroupChannel[Group].RuntimeUpdated = FALSE;

        /* Restart group conversion */
        Adc_Sar_Ip_StartConversion(PhysicalHwUnitId, ChainType);
    }
}
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

/**
* @brief          This function handles the normal conversion ending.
* @details        When a normal (not injected) conversion ends, and the end of
*                 conversion ISR is called, this function takes care about the
*                 driver and the module state transitions.
*
* @param[in]      Unit                the current HW Unit.
* @param[in]      InjectedFlag        Normal or Injected conversion.
* @param[in]      CoreId              Current CoreID
*
* @return         void
*
* @api
* @implements     Adc_Ipw_EndSoftwareConv_Activity
*/
static inline void Adc_Ipw_EndSoftwareConv(Adc_HwUnitType Unit,
                                           boolean InjectedFlag,
                                           uint32 CoreId)
{
    Adc_GroupType GroupIndex = 0U;
    Adc_GroupType Group = 0U;
    /* Streaming num samples should be at least 1U */
    Adc_StreamNumSampleType GroupSamples;
    Std_ReturnType CheckingStatus = (Std_ReturnType) E_OK;
#if defined(ADC_DMA_SUPPORTED) || (ADC_SETCHANNEL_API == STD_ON)
    const Adc_GroupConfigurationType * GroupPtr; /* Pointer to AdcGroup */
#endif /* defined(ADC_DMA_SUPPORTED) || (ADC_SETCHANNEL_API == STD_ON) */
#ifdef ADC_DMA_SUPPORTED
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    Std_ReturnType LimitCheckDmaStatus = (Std_ReturnType) E_OK;
    const uint32 AdcDmaLogicChId = (uint32) Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[Unit];
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */
#endif /*ADC_DMA_SUPPORTED*/
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

    /* Get the group to be converted */
#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)
    if (TRUE == InjectedFlag)
    {
        Group = Adc_axUnitStatus[Unit].SwInjectedQueue[0];
    }
    else
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */
    {
        Group = Adc_axUnitStatus[Unit].SwNormalQueue[0];
    }

    GroupIndex = Adc_apxCfgPtr[CoreId]->GroupIdToIndexMapPtr[Group];
    GroupSamples = Adc_apxCfgPtr[CoreId]->GroupsPtr[GroupIndex].NumSamples;

#if defined(ADC_DMA_SUPPORTED) || (ADC_SETCHANNEL_API == STD_ON)
    GroupPtr = &(Adc_apxCfgPtr[CoreId]->GroupsPtr[GroupIndex]);
#endif /* defined(ADC_DMA_SUPPORTED) || (ADC_SETCHANNEL_API == STD_ON) */

#if (ADC_SETCHANNEL_API == STD_ON)
    /* Check if channel was updated before interrupt of previous conversions */
    if (TRUE == Adc_axRuntimeGroupChannel[Group].RuntimeUpdated)
    {
        Adc_Ipw_ConfigureRuntimeSoftwareGroup(GroupPtr, PhysicalHwUnitId, InjectedFlag, CoreId);
    }
    else
#endif /* (ADC_SETCHANNEL_API == STD_ON) */
    {
#ifdef ADC_DMA_SUPPORTED
        if (ADC_DMA != Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit])
        {
#endif /*ADC_DMA_SUPPORTED*/
            /* Get the conversion result and save to buffer */
            CheckingStatus = Adc_Ipw_RecordResult(Unit, Group, GroupSamples, CoreId);
#ifdef ADC_DMA_SUPPORTED
            Adc_Sar_Ip_DisableDma(PhysicalHwUnitId);
            Adc_Sar_Ip_DisableChannelDma(PhysicalHwUnitId, GroupPtr->LastCh);
        }
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
        else
        {
            LimitCheckDmaStatus = Adc_Ipw_CheckGroupConvResultDma(GroupPtr, AdcDmaLogicChId, CoreId);
        }
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
#endif /*ADC_DMA_SUPPORTED*/

#if (defined(ADC_DMA_SUPPORTED) && (ADC_ENABLE_LIMIT_CHECK == STD_ON))
        if ((Std_ReturnType)E_OK == LimitCheckDmaStatus)
#endif /* defined(ADC_DMA_SUPPORTED) && (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
        {
#if (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON)
            /* Call extra notification (if available) before updating registers (SWS_Adc_00060) */
            Adc_Ipw_CallExtraNotification(Group, CoreId);
#endif /* (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON) */

#if (ADC_SETCHANNEL_API == STD_ON)
            if (TRUE == Adc_axRuntimeGroupChannel[Group].RuntimeUpdated)
            {
                Adc_Ipw_ConfigureRuntimeSoftwareGroup(GroupPtr, PhysicalHwUnitId, InjectedFlag, CoreId);
            }
            else
#endif /* (ADC_SETCHANNEL_API == STD_ON) */
            {
#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)
                if (TRUE == InjectedFlag)
                {
    #ifdef ADC_DMA_SUPPORTED
        #if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
                    if (ADC_DMA == Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit])
                    {
                        if (Adc_axUnitStatus[Unit].SwNormalQueueIndex > (Adc_QueueIndexType)0U)
                        {
                            /* Restart normal conversion */
                            Adc_Ipw_StartNormalConversion(Unit, CoreId);
                        }
                    }
        #endif /* (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) */
    #endif /* ADC_DMA_SUPPORTED */
                    if ((Std_ReturnType)E_NOT_OK == CheckingStatus)
                    {
                        Adc_axGroupStatus[Group].ResultIndex = 0U;
                    }
                }
                else
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */
                {
                    if ((Std_ReturnType)E_NOT_OK == CheckingStatus)
                    {
                        if (ADC_CONV_MODE_ONESHOT == Adc_apxCfgPtr[CoreId]->GroupsPtr[GroupIndex].Mode)
                        {
                            /* Disable end of chain interrupt mask */
#if (defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) || defined(ADC_UNIT_2_NORMAL_ISR_USED))
                            Adc_Sar_Ip_DisableNotifications(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN);
#endif /* (defined(ADC_UNIT_0_NORMAL_ISR_USED) || ... */
                        }

                        /* Clear normal interrupt flag */
                        Adc_Sar_Ip_ClearStatusFlags(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN);
                    }
#ifdef ADC_DMA_SUPPORTED
#if (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS)
                    if (FALSE == GroupPtr->AdcOptimizeDmaStream)
#endif /* (STD_ON == ADC_OPTIMIZE_DMA_STREAMING_GROUPS) */
#endif /* ADC_DMA_SUPPORTED */
                    {
                        if ((Std_ReturnType)E_OK == CheckingStatus)
                        {
                            /* Increment ResultIndex with modulo 'NumSamples' to remember that another sample is completed */
                            Adc_axGroupStatus[Group].ResultIndex++;
                        }
                    }
                }
            }
            if ((Std_ReturnType)E_OK == CheckingStatus)
            {
                /* Update group state and continue conversion */
                Adc_Ipw_UpdateGroupState(Unit, Group, GroupSamples, InjectedFlag, CoreId);
            }
        }
    }
}
#endif /* defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) ||... */

#if (ADC_HW_TRIGGER_API == STD_ON)
#if ( \
        ((defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) || defined(ADC_UNIT_2_NORMAL_ISR_USED)) && (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)) || \
        defined(ADC_UNIT_0_INJECTED_ISR_USED) || defined(ADC_UNIT_1_INJECTED_ISR_USED) || defined(ADC_UNIT_2_INJECTED_ISR_USED) || \
        defined(ADC_UNIT_0_DMA_TRANSFER_USED) || defined(ADC_UNIT_1_DMA_TRANSFER_USED) || defined(ADC_UNIT_2_DMA_TRANSFER_USED) || \
        ((defined(ADC_UNIT_0_BCTU_LIST_ISR_USED) || defined(ADC_UNIT_1_BCTU_LIST_ISR_USED) || defined(ADC_UNIT_2_BCTU_LIST_ISR_USED)) && (ADC_IPW_BCTU_AVAILABLE == STD_ON)) \
    )
#if (ADC_SETCHANNEL_API == STD_ON)
/**
* @brief          This function configs command lists for trigger unit
*                 channel in adc unit when a hardware conversion ends
*
* @details        This function configs command lists for trigger unit
*                 channel in adc unit when a hardware conversion ends
*
* @param[in]      Unit                  The current HW Unit.
* @param[in]      InjectedFlag          Normal or Injected conversion.
* @param[in]      CoreId                Current CoreID
*
* @return         Std_ReturnType
*
* @api
* @implements     Adc_Ipw_ConfigureRuntimeHardwareGroup_Activity
*/
static inline Std_ReturnType Adc_Ipw_ConfigureRuntimeHardwareGroup(Adc_HwUnitType Unit,
                                                                   boolean InjectedFlag,
                                                                   uint32 CoreId)
{
    Adc_Sar_Ip_ChansIdxMaskType CmrMask;
    Std_ReturnType ReturnStatus = (Std_ReturnType)E_OK;

