Jonah-Zhang1/Jonah-Zhang1/R422_S32K324_TEMPLATE_ETH_M7_0/MCAL/Adc_TS_T40D34M20I0R0/src/Adc_Ipw_Irq.c
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
    uint8 ChanList[ADC_MAX_CHANNEL_PER_HW_UNIT];
    Adc_ChannelIndexType ChannelCount;
    Bctu_Ip_TrigConfigType TrigConfig;
    Bctu_Ip_StatusType BctuStatus;
    const Adc_Ipw_Config * const AdcIpwConfigPtr = Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr;
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */
    const Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

    /* Get the group to be converted */
    Adc_GroupType Group = Adc_axUnitStatus[Unit].OngoingHwGroup;
    Adc_GroupType GroupIndex = Adc_apxCfgPtr[CoreId]->GroupIdToIndexMapPtr[Group];
    const Adc_GroupConfigurationType * GroupPtr = &(Adc_apxCfgPtr[CoreId]->GroupsPtr[GroupIndex]);

#if ((ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) && ((ADC_IPW_CTU_AVAILABLE == STD_ON) || (ADC_IPW_BCTU_AVAILABLE == STD_ON)))
    if (GroupPtr->HwTriggerSource <= (Adc_HwTriggerTimerType)ADC_IPW_MAX_CTU_TRIG_SOURCE_ID)
    {
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
        Bctu_Ip_SetGlobalTriggerEn(ADC_IPW_CTU_UNIT_USED, FALSE);

        /* Get index of List channel register */
        TrigConfig.TrigIndex       = (uint8)GroupPtr->HwTriggerSource;
        TrigConfig.LoopEn         = FALSE;
        TrigConfig.DataDest       = BCTU_IP_DATA_DEST_ADC_DATA_REG;
        TrigConfig.HwTriggersEn   = TRUE;
        TrigConfig.AdcTargetMask = (1u << PhysicalHwUnitId);
        TrigConfig.TrigType = BCTU_IP_TRIG_TYPE_LIST;
        /* Use list address start index allocated for the HW unit */
        TrigConfig.AdcChanOrListStart = AdcIpwConfigPtr->CtuListStartIndex[Unit];

        BctuStatus = Bctu_Ip_ConfigTrigger(ADC_IPW_CTU_UNIT_USED, &TrigConfig);
        if (BctuStatus == BCTU_IP_STATUS_SUCCESS)
        {
            ChannelCount = Adc_axRuntimeGroupChannel[Group].ChannelCount;

            Adc_Ipw_GetCtuChanList(ChanList, (uint8)ChannelCount, Group, Unit, CoreId);

            Bctu_Ip_ConfigChanListSimple(ADC_IPW_CTU_UNIT_USED, AdcIpwConfigPtr->CtuListStartIndex[Unit], ChanList, ChannelCount);

            Bctu_Ip_SetGlobalTriggerEn(ADC_IPW_CTU_UNIT_USED, TRUE);
        }
        else
        {
            ReturnStatus = (Std_ReturnType)E_NOT_OK;
        }
#else /* ADC_IPW_CTU_AVAILABLE */
        ReturnStatus = Adc_Ipw_CtuTriggerEnable(Group, GroupPtr->HwTriggerSource, TRUE, TRUE, CoreId);
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */
    }
    else
#endif /* (ADC_IPW_CTU_TRIGGER_MODE_SUPPORTED == STD_ON) && ((ADC_IPW_CTU_AVAILABLE == STD_ON) || (ADC_IPW_BCTU_AVAILABLE == STD_ON)) */
    {
        Adc_Ipw_GetCmrRegister(Unit, Group, &CmrMask, CoreId);
        if (TRUE == InjectedFlag)
        {
            Adc_Sar_Ip_ChainConfig(PhysicalHwUnitId, &CmrMask, ADC_SAR_IP_CONV_CHAIN_INJECTED);
        }
    #if (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)
        else
        {
            Adc_Sar_Ip_ChainConfig(PhysicalHwUnitId, &CmrMask, ADC_SAR_IP_CONV_CHAIN_NORMAL);
        }
    #endif /* (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON) */
    }

    if (ReturnStatus == (Std_ReturnType)E_OK)
    {
        Adc_axGroupStatus[Group].ResultIndex = 0U;
        Adc_axRuntimeGroupChannel[Group].RuntimeUpdated =  FALSE;
    }

    return ReturnStatus;
}
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
/**
* @brief          This function disable trigger source and notifications.
* @details        This function disable trigger source and notifications.
*
* @param[in]      Unit                 The current HW Unit.
* @param[in]      InjectedFlag         Normal or Injected conversion.
* @param[in]      TriggerSrc           Hardware trigger source
* @param[in]      CoreId               Current CoreID
*
* @return         void
*
* @api
* @implements     Adc_Ipw_DisableHwTriggerSrc_Activity
*/
static inline void Adc_Ipw_DisableHwTriggerSrc(Adc_HwUnitType Unit,
                                               boolean InjectedFlag,
                                               Adc_HwTriggerTimerType TriggerSrc,
                                               uint32 CoreId)
{
    Adc_HwUnitType PhysicalHwUnitId = Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];

    /* Stop Conversion */
    if (TRUE == InjectedFlag)
    {
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
        if (TriggerSrc <= (Adc_HwTriggerTimerType)ADC_IPW_MAX_CTU_TRIG_SOURCE_ID)
        {
            /* Conversion triggered by BCTU/CTU */
            Bctu_Ip_DisableHwTrigger(ADC_IPW_CTU_UNIT_USED, (uint8)TriggerSrc);

            /* Not needed to clear interrupt flags status, because this is already done in IPL interrupt,
            before calling the IPW function as notification */
        }
        else
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */
        {
            /* Conversion is External Trigger */
            /* Disable injected external trigger input */
            Adc_Sar_Ip_SetExternalTrigger(PhysicalHwUnitId, ADC_SAR_IP_EXT_TRIG_EDGE_DISABLED, ADC_SAR_IP_INJECTED_EXT_TRIG);
#if (defined(ADC_UNIT_0_INJECTED_ISR_USED) || defined(ADC_UNIT_1_INJECTED_ISR_USED) || defined(ADC_UNIT_2_INJECTED_ISR_USED))
            Adc_Sar_Ip_DisableNotifications(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN);
#endif /* (defined(ADC_UNIT_0_INJECTED_ISR_USED) || ... */
        }
    }
#if (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)
    else
    {
        /* Disable normal external trigger input */
#if FEATURE_ADC_HAS_AUX_EXT_TRIGGER
        Adc_Sar_Ip_SetExternalTrigger(PhysicalHwUnitId, ADC_SAR_IP_EXT_TRIG_EDGE_DISABLED, ADC_SAR_IP_ALL_NORMAL_EXT_TRIG);
#else
        Adc_Sar_Ip_SetExternalTrigger(PhysicalHwUnitId, ADC_SAR_IP_EXT_TRIG_EDGE_DISABLED, ADC_SAR_IP_NORMAL_EXT_TRIG);
#endif /* FEATURE_ADC_HAS_AUX_EXT_TRIGGER */

#if (defined(ADC_UNIT_0_NORMAL_ISR_USED) || defined(ADC_UNIT_1_NORMAL_ISR_USED) || defined(ADC_UNIT_2_NORMAL_ISR_USED))
        Adc_Sar_Ip_DisableNotifications(PhysicalHwUnitId, ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN);
#endif /* (defined(ADC_UNIT_0_NORMAL_ISR_USED) || ... */
    }
#endif /* (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON) */

    Adc_axUnitStatus[Unit].OngoingHwGroup = ADC_INVALID_HW_GROUP_ID;
}
#endif /* ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF */

/**
* @brief          This function handles the conversion by hardware trigger ending.
* @details        When a hardware conversion ends, and the end of conversion
*                 ISR is called, this function takes care about the
*                 driver and the module state transitions.
*
* @param[in]      Unit                The current HW Unit.
* @param[in]      InjectedFlag        Normal or Injected conversion.
* @param[in]      CoreId              Current CoreID
*
* @return         void
*
* @api
* @implements     Adc_Ipw_EndHardwareConv_Activity
*/
static inline void Adc_Ipw_EndHardwareConv(Adc_HwUnitType Unit,
                                           boolean InjectedFlag,
                                           uint32 CoreId)
{
    Adc_GroupType GroupIndex;
    Adc_GroupType Group;
    /* Streaming num samples should be at least 1U */
    Adc_StreamNumSampleType GroupSamples;
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
    boolean  CallNotification = FALSE;
#endif /* ADC_GRP_NOTIF_CAPABILITY */
    Std_ReturnType  ReturnStatus = (Std_ReturnType) E_OK;
#if (ADC_SETCHANNEL_API == STD_ON)
    Std_ReturnType  TempStatus = (Std_ReturnType) E_OK;
#endif /* (ADC_SETCHANNEL_API == STD_ON) */
    const Adc_GroupConfigurationType * GroupPtr = NULL_PTR;
#if (defined(ADC_DMA_SUPPORTED) || (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF))
    const Adc_Ipw_Config * const AdcIpwConfigPtr = Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr;
#endif /* defined(ADC_DMA_SUPPORTED) || (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) */
#ifdef ADC_DMA_SUPPORTED
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
    Dma_Ip_LogicChannelScatterGatherListType LocTransferList[1U];
    boolean StreamLinearDone = FALSE;
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) */
    Adc_HwUnitType PhysicalHwUnitId = AdcIpwConfigPtr->AdcPhysicalIdArr[Unit];
    const uint32 AdcDmaLogicChId = AdcIpwConfigPtr->Mapping.AdcDmaChannelLogicId[Unit];
#endif /* defined(ADC_DMA_SUPPORTED) */
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
    boolean RuntimeChanUpdated = FALSE;
    Adc_StreamNumSampleType CurrentSampleCount = 0U;
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) */

    /* Get the group to be converted. There is only one Hardware Group working at a time. */
    Group = Adc_axUnitStatus[Unit].OngoingHwGroup;
    GroupIndex = Adc_apxCfgPtr[CoreId]->GroupIdToIndexMapPtr[Group];
    GroupPtr = &(Adc_apxCfgPtr[CoreId]->GroupsPtr[GroupIndex]);

#if (ADC_SETCHANNEL_API == STD_ON)
    if (TRUE == Adc_axRuntimeGroupChannel[Group].RuntimeUpdated)
    {
        /* Configure the new list of channels even recording results were incorrect.*/
        (void)Adc_Ipw_ConfigureRuntimeHardwareGroup(Unit, InjectedFlag, CoreId);
    }
    else
#endif /* (ADC_SETCHANNEL_API == STD_ON) */
    {
        if (((ADC_CONV_TYPE_INJECTED == GroupPtr->Type) && (FALSE == InjectedFlag)) || \
            ((ADC_CONV_TYPE_NORMAL == GroupPtr->Type) && ((boolean)TRUE == InjectedFlag)) \
           )
        {
            /* Return when group conversion type doesn't match the ISR handler type (normal/injected) */
            ReturnStatus = (Std_ReturnType) E_NOT_OK;
        }

        if ((Std_ReturnType)E_OK == ReturnStatus)
        {
            GroupSamples = GroupPtr->NumSamples;

#ifdef ADC_DMA_SUPPORTED
            if (ADC_DMA != AdcIpwConfigPtr->Mapping.AdcDmaInterruptSoftware[Unit])
            {
#endif /*ADC_DMA_SUPPORTED*/
                /* Get the conversion result and save to buffer */
                ReturnStatus = Adc_Ipw_RecordResult(Unit, Group, GroupSamples, CoreId);
#ifdef ADC_DMA_SUPPORTED
                Adc_Sar_Ip_DisableDma(PhysicalHwUnitId);
                Adc_Sar_Ip_DisableChannelDma(PhysicalHwUnitId, GroupPtr->LastCh);
            }
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
            else
            {
                ReturnStatus = Adc_Ipw_CheckGroupConvResultDma(GroupPtr, AdcDmaLogicChId, CoreId);
            }
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
#endif /*ADC_DMA_SUPPORTED*/
#if (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON)
        /* Call extra notification (if available) before updating registers (SWS_Adc_00060) */
            Adc_Ipw_CallExtraNotification(Group, CoreId);
#endif /* (ADC_ENABLE_INITIAL_NOTIFICATION == STD_ON) */

#if (ADC_SETCHANNEL_API == STD_ON)
            if (TRUE == Adc_axRuntimeGroupChannel[Group].RuntimeUpdated)
            {
                /* Configure the new list of channels even recording results were incorrect.*/
                TempStatus = Adc_Ipw_ConfigureRuntimeHardwareGroup(Unit, InjectedFlag, CoreId);
                if ((Std_ReturnType)E_NOT_OK == TempStatus)
                {
                    ReturnStatus = (Std_ReturnType)E_NOT_OK;
                }
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
                else
                {
                    RuntimeChanUpdated = TRUE;
                }
#endif /* (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF) */
            }
#endif /* (ADC_SETCHANNEL_API == STD_ON) */

            if ((Std_ReturnType)E_OK == ReturnStatus)
            {
#if (ADC_OPTIMIZE_ONESHOT_HW_TRIGGER == STD_OFF)
                CurrentSampleCount = Adc_Ipw_GetNumsCurrentSample(AdcIpwConfigPtr, GroupPtr, RuntimeChanUpdated);
                /* At least once the group was converted */
                Adc_axGroupStatus[Group].AlreadyConverted = ADC_ALREADY_CONVERTED;
                if (ADC_BUSY == Adc_axGroupStatus[Group].Conversion)
                {
                    /* SWS_Adc_00224 */
                    Adc_axGroupStatus[Group].Conversion = ADC_COMPLETED;
                }

