Jonah-Zhang1/Jonah-Zhang1/R422_S32K324_TEMPLATE_ETH_M7_0/MCAL/Adc_TS_T40D34M20I0R0/src/Adc_Ipw_Irq.c
#ifdef ADC_UNIT_1_INJECTED_ISR_USED
/**
* @brief          This function implements the end of injected chain notification for
*                 ADC Hardware Unit 1.
* @details        This function implements the end of injected chain notification for
*                 ADC Hardware Unit 1.
*
* @return         void
*
*/
void Adc_Ipw_Adc1EndInjectedChainNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 1U;

    Adc_Ipw_EndInjectedChainNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_1_INJECTED_ISR_USED */

#if (defined(ADC_DMA_SUPPORTED) && defined(ADC_UNIT_1_DMA_TRANSFER_USED))
/**
* @brief          This function implements the end of dma transfer notification for
*                 ADC Hardware Unit 0.
* @details        This function implements the end of normal chain notification for
*                 ADC Hardware Unit 0.
*
* @return         void
*
*/
void Adc_Ipw_Adc1DmaTransferCompleteNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 1U;
    uint32 AdcStatusFlag;

    AdcStatusFlag = Adc_Sar_Ip_GetStatusFlags(PhysicalAdcUnit);

    if ((AdcStatusFlag & ADC_SAR_IP_STATUS_FLAG_NORMAL_ENDCHAIN) != 0U)
    {
        Adc_Ipw_EndNormalChainNotification(PhysicalAdcUnit);
    }
    else if ((AdcStatusFlag & (ADC_SAR_IP_STATUS_FLAG_INJECTED_ENDCHAIN | ADC_SAR_IP_STATUS_FLAG_CTU_EOC)) != 0U)
    {
        Adc_Ipw_EndInjectedChainNotification(PhysicalAdcUnit);
    }
    else
    {
        ; /* Empty else branch to avoid MISRA */
    }
}
#endif /* (defined(ADC_DMA_SUPPORTED) && defined(ADC_UNIT_1_DMA_TRANSFER_USED)) */

/*==================================================================================================
                                          ADC HW UNIT 2
==================================================================================================*/
#if ((defined(ADC_UNIT_2_WDG_ISR_USED)) && (defined(ADC_WDG_SUPPORTED)))
/**
* @brief          This function implements the Wdg threshold notification for
*                 ADC Hardware Unit 2.
* @details        This function implements the Wdg threshold notification for
*                 ADC Hardware Unit 2.
*
* @return         void
*
*/
void Adc_Ipw_Adc2WdgThresholdNotification(const uint16 PhysicalChanId,
                                          const uint8 Flags)
{
    const Adc_HwUnitType PhysicalAdcUnit = 2U;

    Adc_Ipw_WdgThresholdNotification(PhysicalAdcUnit, (Adc_ChannelType)PhysicalChanId, Flags);
}
#endif /* ((defined(ADC_UNIT_2_WDG_ISR_USED)) && (defined(ADC_WDG_SUPPORTED))) */

#ifdef ADC_UNIT_2_NORMAL_ISR_USED
/**
* @brief          This function implements the end of normal chain notification for
*                 ADC Hardware Unit 2.
* @details        This function implements the end of normal chain notification for
*                 ADC Hardware Unit 2.
*
* @return         void
*
*/
void Adc_Ipw_Adc2EndNormalChainNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 2U;

    Adc_Ipw_EndNormalChainNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_2_NORMAL_ISR_USED */

#ifdef ADC_UNIT_2_INJECTED_ISR_USED
/**
* @brief          This function implements the end of injected chain notification for
*                 ADC Hardware Unit 2.
* @details        This function implements the end of injected chain notification for
*                 ADC Hardware Unit 2.
*
* @return         void
*
*/
void Adc_Ipw_Adc2EndInjectedChainNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 2U;

    Adc_Ipw_EndInjectedChainNotification(PhysicalAdcUnit);
}
#endif /* ADC_UNIT_2_INJECTED_ISR_USED */

#if (defined(ADC_DMA_SUPPORTED) && defined(ADC_UNIT_2_DMA_TRANSFER_USED))
/**
* @brief          This function implements the end of dma transfer notification for
*                 ADC Hardware Unit 0.
* @details        This function implements the end of normal chain notification for
*                 ADC Hardware Unit 0.
*
* @return         void
*
*/
void Adc_Ipw_Adc2DmaTransferCompleteNotification(void)
{
    const Adc_HwUnitType PhysicalAdcUnit = 2U;
    uint32 AdcStatusFlag;

    AdcStatusFlag = Adc_Sar_Ip_GetStatusFlags(PhysicalAdcUnit);

    if ((AdcStatusFlag & ADC_SAR_IP_STATUS_FLAG_NORMAL_ENDCHAIN) != 0U)
    {
        Adc_Ipw_EndNormalChainNotification(PhysicalAdcUnit);
    }
    else if ((AdcStatusFlag & (ADC_SAR_IP_STATUS_FLAG_INJECTED_ENDCHAIN | ADC_SAR_IP_STATUS_FLAG_CTU_EOC)) != 0U)
    {
        Adc_Ipw_EndInjectedChainNotification(PhysicalAdcUnit);
    }
    else
    {
        ; /* Empty else branch to avoid MISRA */
    }
}
#endif /* (defined(ADC_DMA_SUPPORTED) && defined(ADC_UNIT_2_DMA_TRANSFER_USED)) */

/*==================================================================================================
                                          BCTU UNIT 0
==================================================================================================*/
#if (ADC_HW_TRIGGER_API == STD_ON)
#if (ADC_IPW_BCTU_AVAILABLE == STD_ON)
#ifdef ADC_UNIT_0_BCTU_LIST_ISR_USED

/**
* @brief          This function handles internal ADC updates after the BCTU list is complete, in Triggered Mode
* @details        The function is a notification to be called by BCTU IPL, corresponding to execution of the last conversion in a LIST of conversions for ADC0
*
* @return         void
*/
void Adc_Ipw_BctuEndListNotificationAdc0(void)
{
    const volatile uint32 CoreId = Adc_GetCoreID();
    const Adc_HwUnitType LogicalHwUnitId = Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr->Mapping.HwLogicalId[0U];

    if (LogicalHwUnitId == ADC_IPW_INVALID_LOGICAL_UNIT_ID)
    {
        /* The interrupt is spurious or ADC unit assigned to invalid core partition.
        No DEM or DET error reporting inside ISR functions.
        Rationale: The DEM or DET callback is long in its full implementation, delaying the ISR. */
    }
    else
    {
        Adc_Ipw_EndHardwareConv(LogicalHwUnitId, TRUE, CoreId);
    }
}
#endif /* ADC_UNIT_0_BCTU_LIST_ISR_USED */

#ifdef ADC_UNIT_1_BCTU_LIST_ISR_USED

/**
* @brief          This function handles internal ADC updates after the BCTU list is complete, in Triggered Mode
* @details        The function is a notification to be called by BCTU IPL, corresponding to execution of the last conversion in a LIST of conversions for ADC1
*
* @return         void
*/
void Adc_Ipw_BctuEndListNotificationAdc1(void)
{
    const volatile uint32 CoreId = Adc_GetCoreID();
    const Adc_HwUnitType LogicalHwUnitId = Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr->Mapping.HwLogicalId[1U];

    if (LogicalHwUnitId == ADC_IPW_INVALID_LOGICAL_UNIT_ID)
    {
        /* The interrupt is spurious or ADC unit assigned to invalid core partition.
        No DEM or DET error reporting inside ISR functions.
        Rationale: The DEM or DET callback is long in its full implementation, delaying the ISR. */
    }
    else
    {
        Adc_Ipw_EndHardwareConv(LogicalHwUnitId, TRUE, CoreId);
    }
}
#endif /* ADC_UNIT_1_BCTU_LIST_ISR_USED */

#ifdef ADC_UNIT_2_BCTU_LIST_ISR_USED

/**
* @brief          This function handles internal ADC updates after the BCTU list is complete, in Triggered Mode
* @details        The function is a notification to be called by BCTU IPL, corresponding to execution of the last conversion in a LIST of conversions for ADC2
*
* @return         void
*/
void Adc_Ipw_BctuEndListNotificationAdc2(void)
{
    const volatile uint32 CoreId = Adc_GetCoreID();
    const Adc_HwUnitType LogicalHwUnitId = Adc_apxCfgPtr[CoreId]->AdcIpwConfigPtr->Mapping.HwLogicalId[2U];

    if (LogicalHwUnitId == ADC_IPW_INVALID_LOGICAL_UNIT_ID)
    {
        /* The interrupt is spurious or ADC unit assigned to invalid core partition.
        No DEM or DET error reporting inside ISR functions.
        Rationale: The DEM or DET callback is long in its full implementation, delaying the ISR. */
    }
    else
    {
        Adc_Ipw_EndHardwareConv(LogicalHwUnitId, TRUE, CoreId);
    }
}
#endif /* ADC_UNIT_2_BCTU_LIST_ISR_USED */

#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
#endif /* (ADC_IPW_BCTU_AVAILABLE == STD_ON) */

#define ADC_STOP_SEC_CODE
#include "Adc_MemMap.h"

#ifdef __cplusplus
}
#endif

/** @} */
